balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F3011.PIC
        <edc:AdjustPoint edc:offset="90"/>
        <edc:SFRDef edc:access="------rrrrrrrrrr" edc:cname="ADCBUF0" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------uuuuuuuuuu" edc:name="ADCBUF0" edc:nzwidth="0x10" edc:por="------xxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF0" edc:desc="" edc:islanghidden="true" edc:mask="0x3ff" edc:name="ADCBUF0" edc:nzwidth="0xa"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------rrrrrrrrrr" edc:cname="ADCBUF1" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------uuuuuuuuuu" edc:name="ADCBUF1" edc:nzwidth="0x10" edc:por="------xxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF1" edc:desc="" edc:islanghidden="true" edc:mask="0x3ff" edc:name="ADCBUF1" edc:nzwidth="0xa"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------rrrrrrrrrr" edc:cname="ADCBUF2" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------uuuuuuuuuu" edc:name="ADCBUF2" edc:nzwidth="0x10" edc:por="------xxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF2" edc:desc="" edc:islanghidden="true" edc:mask="0x3ff" edc:name="ADCBUF2" edc:nzwidth="0xa"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------rrrrrrrrrr" edc:cname="ADCBUF3" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------uuuuuuuuuu" edc:name="ADCBUF3" edc:nzwidth="0x10" edc:por="------xxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF3" edc:desc="" edc:islanghidden="true" edc:mask="0x3ff" edc:name="ADCBUF3" edc:nzwidth="0xa"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------rrrrrrrrrr" edc:cname="ADCBUF4" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------uuuuuuuuuu" edc:name="ADCBUF4" edc:nzwidth="0x10" edc:por="------xxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF4" edc:desc="" edc:islanghidden="true" edc:mask="0x3ff" edc:name="ADCBUF4" edc:nzwidth="0xa"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------rrrrrrrrrr" edc:cname="ADCBUF5" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------uuuuuuuuuu" edc:name="ADCBUF5" edc:nzwidth="0x10" edc:por="------xxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF5" edc:desc="" edc:islanghidden="true" edc:mask="0x3ff" edc:name="ADCBUF5" edc:nzwidth="0xa"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------rrrrrrrrrr" edc:cname="ADCBUF6" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------uuuuuuuuuu" edc:name="ADCBUF6" edc:nzwidth="0x10" edc:por="------xxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF6" edc:desc="" edc:islanghidden="true" edc:mask="0x3ff" edc:name="ADCBUF6" edc:nzwidth="0xa"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------rrrrrrrrrr" edc:cname="ADCBUF7" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------uuuuuuuuuu" edc:name="ADCBUF7" edc:nzwidth="0x10" edc:por="------xxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF7" edc:desc="" edc:islanghidden="true" edc:mask="0x3ff" edc:name="ADCBUF7" edc:nzwidth="0xa"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------rrrrrrrrrr" edc:cname="ADCBUF8" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------uuuuuuuuuu" edc:name="ADCBUF8" edc:nzwidth="0x10" edc:por="------xxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF8" edc:desc="" edc:islanghidden="true" edc:mask="0x3ff" edc:name="ADCBUF8" edc:nzwidth="0xa"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------rrrrrrrrrr" edc:cname="ADCBUF9" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------uuuuuuuuuu" edc:name="ADCBUF9" edc:nzwidth="0x10" edc:por="------xxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF9" edc:desc="" edc:islanghidden="true" edc:mask="0x3ff" edc:name="ADCBUF9" edc:nzwidth="0xa"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
